newwms_gift/src/Documents/МотивационныеНачисления/МотивационныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МотивационныеНачисления</name>
  <registerRecords>InformationRegister.МотивационныеНачисленияРаботниковСклада</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыРаботниковСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботникиСклада</name>
    <attributes>
      <name>РаботникСклада</name>
      <type>
        <types>CatalogRef.итWMSРаботникиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>РаботникСклада</name>
      <type>
        <types>CatalogRef.итWMSРаботникиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗадачи</name>
      <type>
        <types>EnumRef.итWMSТипыЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/InformationRegisters/МотивационныеНачисленияРаботниковСклада/МотивационныеНачисленияРаботниковСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МотивационныеНачисленияРаботниковСклада</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Начислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РаботникСклада</name>
    <type>
      <types>CatalogRef.итWMSРаботникиСклада</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыРаботниковСклада</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Documents/МотивационныеНачисления/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НаличиеДокументовНаТекущуДатуНачисленияИСмену() Тогда 
		Отказ=Истина;
	КонецЕсли;	
	Если  не ПроверитьЗаполнение() Тогда 
		Отказ=Истина;
	КонецЕсли;	
КонецПроцедуры


Функция НаличиеДокументовНаТекущуДатуНачисленияИСмену()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МотивационныеНачисления.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.МотивационныеНачисления КАК МотивационныеНачисления
		|ГДЕ
		|	МотивационныеНачисления.Ссылка <> &Ссылка
		|	И МотивационныеНачисления.ДатаНачисления = &ДатаНачисления
		|	И МотивационныеНачисления.Смена = &Смена
		|	И МотивационныеНачисления.Проведен";
	
	Запрос.УстановитьПараметр("ДатаНачисления", ДатаНачисления);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("на текущую дату начисления уже имеется регистратор "+Строка(ВыборкаДетальныеЗаписи.Ссылка));
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;	
КонецФункции


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
МотивационныеНачисленияРаботниковСклада=Движения.МотивационныеНачисленияРаботниковСклада;
Движения.МотивационныеНачисленияРаботниковСклада.Записывать=Истина;
Для Каждого  стр из Начисления Цикл 
	НоваяСтрока=МотивационныеНачисленияРаботниковСклада.Добавить();
	НоваяСтрока.Регистратор=Ссылка;
	НоваяСтрока.ДатаНачисления=ДатаНачисления;
	НоваяСтрока.Организация=Организация;
	НоваяСтрока.РаботникСклада=стр.РаботникСклада;
	НоваяСтрока.ТипЗадачи=стр.ТипЗадачи;
	НоваяСтрока.Смена=Смена;
	НоваяСтрока.Начислено=стр.Начислено;
КонецЦикла;
Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	РаботникиСклада.Очистить();
	Начисления.Очистить();
КонецПроцедуры
